docs/doc-notes/how-2019-state-charg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-01 Sat 11:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="classes.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc4c722b">1. State of charge estimation for lithium-ion batteries using model-based and data-driven methods: a review, How, D. N. T., Hannan, M. A., Lipu, M. S. H., &amp; Ker, P. J., IEEE Access, (2019)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="article">article</span></span></a></li>
<li><a href="#org307a68c">2. Notes</a>
<ul>
<li><a href="#org717c665">2.1. INTRODUCTION</a></li>
<li><a href="#org8c0a2b5">2.2. OVERVIEW OF MODEL-BASED AND DATA-DRIVEN METHOD</a>
<ul>
<li><a href="#org1fe781e">2.2.1. Model Approach (white box)</a></li>
<li><a href="#org9965bd1">2.2.2. Data Approach (black box)</a></li>
<li><a href="#orgb3fa235">2.2.3. SOC ESTIMATION METHODS</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc4c722b" class="outline-2">
<h2 id="orgc4c722b"><span class="section-number-2">1.</span> State of charge estimation for lithium-ion batteries using model-based and data-driven methods: a review, How, D. N. T., Hannan, M. A., Lipu, M. S. H., &amp; Ker, P. J., IEEE Access, (2019)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="article">article</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
See <a href="&amp;how-2019-state-charg">&amp;how-2019-state-charg</a>
</p>
</div>
</div>

<div id="outline-container-org307a68c" class="outline-2">
<h2 id="org307a68c"><span class="section-number-2">2.</span> Notes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org717c665" class="outline-3">
<h3 id="org717c665"><span class="section-number-3">2.1.</span> INTRODUCTION</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>The information of this review will be valuable to the academic researcher and automotive engineers towards the
selection of appropriate SOC estimation method which is significant for the enhancement of BMS for future EV
applications.</li>
</ul>
</div>
</div>

<div id="outline-container-org8c0a2b5" class="outline-3">
<h3 id="org8c0a2b5"><span class="section-number-3">2.2.</span> OVERVIEW OF MODEL-BASED AND DATA-DRIVEN METHOD</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org1fe781e" class="outline-4">
<h4 id="org1fe781e"><span class="section-number-4">2.2.1.</span> Model Approach (white box)</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>There exist two established decision-making paradigms to evaluate SOC; model-based and data-driven methods.</li>
<li>This approach often involves the practitioner to have a deep understanding of the system or process in order to
construct the robust rules that can model the behavior of the system accurately</li>
</ul>
</div>
</div>

<div id="outline-container-org9965bd1" class="outline-4">
<h4 id="org9965bd1"><span class="section-number-4">2.2.2.</span> Data Approach (black box)</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>On the other hand, the data-driven based SOC estimation are relatively new approaches enabled by the advent of big
quantity of data and powerful computers.</li>
<li>The data-driven methods (also known as black-box models) are built upon empirical observations with minimal or no
knowledge of the background processes</li>
</ul>
</div>
</div>

<div id="outline-container-orgb3fa235" class="outline-4">
<h4 id="orgb3fa235"><span class="section-number-4">2.2.3.</span> SOC ESTIMATION METHODS</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>Based on recent published articles on SOC estimation, this review divides the SOC estimation methods into five groups
namely; look-up table method, coulomb counting method, model-based estimation methods, data-driven estimation methods,
and hybrid method, as shown in Fig. 5.</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org94b8b62"></a>LOOK-UP TABLE<br />
<div class="outline-text-5" id="text-2-2-3-1">
<ul class="org-ul">
<li>Not relevant</li>
<li>The look-up table method exploits the direct mapping relationship between SOC and the external characteristics
parameters such as the open-circuit voltage (OCV), impedance, etc.</li>
<li>The alternating current (AC) impedance methods is another technique under the look-up table category.</li>
</ul>
</div>
</li>

<li><a id="orgb212c88"></a>COULOMB COUNTING METHOD<br />
<div class="outline-text-5" id="text-2-2-3-2">
<p>
Not relevant
</p>
</div>
</li>

<li><a id="org7aa23fe"></a>MODEL-BASED SOC ESTIMATION METHODS<br />
<div class="outline-text-5" id="text-2-2-3-3">
<ul class="org-ul">
<li>EM Model
<ul class="org-ul">
<li>The model-based SOC estimation methods involve modeling of the electrical, chemical or a combination of both
properties pertaining to a specific battery.</li>
<li>The EM model relies on partial differential equations (PDE) to describe battery dynamics such as lithium diffusion and
potential gradients.</li>
<li>EM method can be very accurate, nonetheless PDE computations can be expensive for real-time SOC estimation
[62].</li>
</ul></li>
<li>ECM Model
<ul class="org-ul">
<li>The ECM model based SOC evaluation requires the derivation of the circuit models consisting of various circuit
elements arranged in series or parallel combination such that it replicates the dynamics of the battery.</li>
<li>The various ECM models have been proposed including the Rint model, the RC model, and the Thevenin model [24].</li>
<li>ECM is computationally inexpensive and has been used by researchers to estimate SOC in conjunction with
adaptive filter algorithms such as the Kalman filter. [67].</li>
</ul></li>
<li>Observer Model
<ul class="org-ul">
<li>A work in [91] proposes a novel observer-based SOC estimation method for LIB, as depicted in Fig. 13.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org01f07b4"></a>Data-Driven SOC Estimation Methods<br />
<div class="outline-text-5" id="text-2-2-3-4">
<ul class="org-ul">
<li>Fuzzy Logic Method
<ul class="org-ul">
<li>There exist a few studies involving FL to estimate SOC. In [142], the authors proposed the use of FL with SVM to
predict SOC of a LIB pack used in EV.</li>
</ul></li>

<li>Hybrid Method
<ul class="org-ul">
<li>Usually, two or three algorithms are combined to develop a hybrid method.</li>
<li>In [149], the authors proposed a charging cell voltage curves (CCCV) hypothesis to estimate the capacity of a LIB
pack.</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-04-01 Sat 11:11</p>
</div>
</body>
</html>
